/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidParameter" = "معامل غير صالح.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationCode" = "رمز عملية غير صالح.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCommunicationManagerError" = "تعذر الاتصال بالخادم. قم بفحص بيانات تسجيل الدخول.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorUserAlreadyLoggedIn" = "تم تسجيل دخول المستخدم بالفعل.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationExecutionInProgress" = "تنفيذ العملية قيد التقدم بالفعل.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationContext" = "سياق العملية غير صالح.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidCommunicatorId" = "معرف غير صالح لبروتوكول الاتصال.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidActionItemId" = "معرف عنصر الإجراء غير صالح.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCouldNotDecideCommunicator" = "تعذر تحديد بروتوكول الاتصال.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidBackendPassword" = "تأكد من كلمة مرورك.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorDeviceAlreadyRegistered" = "تم تسجيل هذا الجهاز بالفعل لمستخدم آخر.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorPasswordsNotEqual" = "رموز المرور التي أدخلتها غير متطابقة.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "غير مسموح بالعملية في هذه الحالة.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidServerHost" = "بيانات تسجيل الدخول التي أدخلتها غير كافية أو غير صالحة. حاول مرة أخرى.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorResetErrorCheckNetwork" = "تعذرت إعادة تعيين التطبيق. تأكد من اتصالك بالشبكة.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckLoginData" = "تعذر الاتصال بالخادم. قم بفحص بيانات تسجيل الدخول.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckUsernamePassword" = "قم بفحص اسم المستخدم وكلمة المرور.";

/* XMSG */
"keyErrDescrMAFLogonErrorConsultWithAdministrator" = "تعذر الاتصال بالخادم، الرجاء مراجعة المسؤول.";

/* XMSG */
"keyErrDescrMAFLogonErrorInvalidLoginData" = "بيانات تسجيل الدخول التي أدخلتها غير كافية أو غير صالحة. حاول مرة أخرى.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeCorrect" = "أدخل رمز المرور الصحيح.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDigit" = "أدخل رمز مرور يحتوي على رقم واحد على الأقل.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDontMatch" = "رموز المرور التي أدخلتها غير متطابقة.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeExpired" = "انتهت صلاحية رمز المرور، ويجب عليك تغييره.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLength" = "أدخل رمز مرور مكون من {0} حرف على الأقل.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLowercase" = "أدخل رمز مرور يحتوي على حرف صغير واحد على الأقل.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeSpecialCharacters" = "أدخل رمز مرور يحتوي على حرف خاص واحد على الأقل.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUniqueCharacters" = "أدخل رمز مرور يحتوي على {0} حرف فريد على الأقل.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUppercase" = "أدخل رمز مرور يحتوي على حرف كبير واحد على الأقل.";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateKeyGeneration" = "تعذر استدعاء المفتاح للشهادة.";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateGeneration" = "تعذر استدعاء الشهادة.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorUnknown" = "خطأ غير معروف";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorAlreadyExists" = "التخزين الآمن موجود بالفعل";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDataTypeError" = "خطأ بنوع البيانات";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDoesNotExist" = "التخزين الآمن غير موجود";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidArg" = "وسيطة غير صالحة";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidPassword" = "أدخل رمز المرور الصحيح.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorLocked" = "التخزين الآمن مؤمن";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorOutOfMemory" = "نفذت ذاكرة التخزين الآمن";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordExpired" = "انتهت صلاحية رمز المرور، ويجب عليك تغييره.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequired" = "أدخل رمز مرور يحتوي على {0} حرف فريد على الأقل.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresDigit" = "أدخل رمز مرور يحتوي على رقم واحد على الأقل.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresLower" = "أدخل رمز مرور يحتوي على حرف صغير واحد على الأقل.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresSpecial" = "أدخل رمز مرور يحتوي على حرف خاص واحد على الأقل.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresUpper" = "أدخل رمز مرور يحتوي على حرف كبير واحد على الأقل.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinLength" = "أدخل رمز مرور مكون من {0} حرف على الأقل.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinUniqueChars" = "أدخل رمز مرور يحتوي على {0} حرف فريد على الأقل.";

/* XMSG */
"keyErrDescrMAFSecureStoreManagerErrorDeleted" = "تم حذف التخزين الآمن.";

/* XMSG */
"keyErrDescrMAFLogonErrorOperationNotSupported" = "العملية غير مدعومة.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidMCIMSSOPin" = "رمز مرور SSO غير صالح.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorAfariaInvalidCredentials" = "بيانات اعتماد Afaria غير صالحة.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorClientIdentityNotFound" = "Client Identity not found";

/* XMSG: message */
"keyErrDescrMAFLogonErrorURLValidationFailed" = "Access is denied";

